khofesh/stm32-projects/nucleo-h533re/002_esp_at_sdio/Core/Src/at_sdio/platform/sdio_driver_port.c
// Copyright 2015-2020 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

/* STM32H5 port. The F1 reference port implements CMD52/CMD53 by hand in
   sdio.c; on H5 stm32h5xx_hal_sdio.c already does that, so this file is only
   the SDMMC1 low level init plus a thin mapping onto the HAL_SDIO API. */

#include <stdio.h>
#include <stdint.h>
#include <stddef.h>

#include "stm32h5xx_hal.h"

#include "sdio_host_log.h"
#include "sdio_host_error.h"
#include "sdio_driver_port.h"
#include "platform_os.h"
#include "sdio.h"

static const char TAG[] = "sdio_driver";

/* Referenced by sdio_host_log.h; raise to 3 for the CCCR dump during bring-up */
int sdio_debugLevel = 3;

SDIO_HandleTypeDef hsdio1;

static volatile uint8_t esp_int_flag;

/* CMD53 byte mode carries a 9-bit count, so a single transfer tops out at 512 */
#define SDIO_PORT_MAX_BYTE_XFER 512U
#define SDIO_CMD53_RETRY_COUNT  32U
/* ...but a data phase that never starts is not worth 32 of them. CRC failures
   are frames lost in flight and retry well; HAL_SDIO_ERROR_TIMEOUT means the
   slave answered R5 and then sent nothing, which it will do again. Burning the
   full count on it left the console dead for 32 s at a stretch. */
#define SDIO_CMD53_TIMEOUT_RETRY 3U

/* ESP-AT can take several seconds to boot and enable its SDIO slave, while the
   STM32 is ready in milliseconds. SDIO_InitCard() sends CMD5 exactly once, so
   enumeration is retried here instead of losing that race on every boot. */
#define SDIO_INIT_RETRY_COUNT   60U
#define SDIO_INIT_RETRY_MS      500U

/* CCCR Bus Interface Control (function 0, register 0x07) */
#define SDIO_CCCR_BUS_IF_CTRL   0x07U
#define SDIO_CCCR_BUS_WIDTH_MSK 0x03U
#define SDIO_CCCR_BUS_WIDTH_1B  0x00U
#define SDIO_CCCR_BUS_WIDTH_4B  0x02U
#define SDIO_OCR_3V3_WINDOW     0x00FF8000U

/**
  * @brief Slave raised its function-1 interrupt (D1 held low).
  *
  * SDMMC_STA_SDIOIT tracks the D1 level and the HAL does not clear it, so the
  * source has to be masked here or the ISR re-enters until the slave releases
  * D1. sdio_driver_wait_int() re-arms it.
  */
static void EspIoInterruptCallback(SDIO_HandleTypeDef *hsdio, uint32_t func)
{
    (void)func;
    __HAL_SDIO_DISABLE_IT(hsdio, SDMMC_IT_SDIOIT);
    esp_int_flag = 1U;
}

/**
  * @brief Select PLL1Q as the SDMMC1 kernel clock.
  *
  * HAL_RCC_OscConfig() only enables the PLL1 P output, so PLL1Q is still off
  * after SystemClock_Config() and the kernel clock frequency reads back as 0.
  * HAL_RCCEx_PeriphCLKConfig() is what turns PLL1Q on, so it has to run before
  * the frequency is queried - i.e. before HAL_SDIO_Init(), not from MspInit.
  */
static HAL_StatusTypeDef SdioKernelClockConfig(void)
{
    RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};

    PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_SDMMC1;

#if (SDIO_PORT_SLOW_KERNEL_CLK != 0)
    /* CLKDIV tops out at 1023, so a 250 MHz kernel clock cannot go below
       122 kHz - and the link is only known to carry a frame at 25 kHz. PLL2R at
       50 MHz moves the whole range down by five: div=1023 is 24 kHz, div=312 is
       80 kHz. Same CSI source as PLL1, so no extra oscillator is needed:
       4 MHz / 1 = 4 MHz in, x100 = 400 MHz VCO, / 8 = 50 MHz. */
    PeriphClkInitStruct.Sdmmc1ClockSelection = RCC_SDMMC1CLKSOURCE_PLL2R;
    PeriphClkInitStruct.PLL2.PLL2Source   = RCC_PLL2_SOURCE_CSI;
    PeriphClkInitStruct.PLL2.PLL2M        = 1;
    PeriphClkInitStruct.PLL2.PLL2N        = 100;
    PeriphClkInitStruct.PLL2.PLL2P        = 2;
    PeriphClkInitStruct.PLL2.PLL2Q        = 2;
    PeriphClkInitStruct.PLL2.PLL2R        = 8;
    PeriphClkInitStruct.PLL2.PLL2RGE      = RCC_PLL2_VCIRANGE_2;
    PeriphClkInitStruct.PLL2.PLL2VCOSEL   = RCC_PLL2_VCORANGE_WIDE;
    PeriphClkInitStruct.PLL2.PLL2FRACN    = 0;
    PeriphClkInitStruct.PLL2.PLL2ClockOut = RCC_PLL2_DIVR;
#else
    PeriphClkInitStruct.Sdmmc1ClockSelection = RCC_SDMMC1CLKSOURCE_PLL1Q;
#endif

    return HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct);
}

void HAL_SDIO_MspInit(SDIO_HandleTypeDef *hsdio)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    if (hsdio->Instance != SDMMC1) {
        return;
    }

    __HAL_RCC_SDMMC1_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();

    /**SDMMC1 GPIO Configuration
    PB2      ------> SDMMC1_CMD
    PB13     ------> SDMMC1_D0
    PC9      ------> SDMMC1_D1
    PC10     ------> SDMMC1_D2
    PC11     ------> SDMMC1_D3
    PC12     ------> SDMMC1_CK
    */
    GPIO_InitStruct.Pin = GPIO_PIN_13;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = SDIO_PORT_GPIO_SPEED;
    GPIO_InitStruct.Alternate = GPIO_AF12_SDMMC1;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    /* CMD alone may be open-drain - see SDIO_PORT_CMD_OPEN_DRAIN */
    GPIO_InitStruct.Pin = GPIO_PIN_2;
#if (SDIO_PORT_CMD_OPEN_DRAIN != 0)
    GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
#endif
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pin = GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

    HAL_NVIC_SetPriority(SDMMC1_IRQn, 5, 0);
    HAL_NVIC_EnableIRQ(SDMMC1_IRQn);
}

void HAL_SDIO_MspDeInit(SDIO_HandleTypeDef *hsdio)
{
    if (hsdio->Instance != SDMMC1) {
        return;
    }

    __HAL_RCC_SDMMC1_CLK_DISABLE();
    HAL_GPIO_DeInit(GPIOB, GPIO_PIN_2 | GPIO_PIN_13);
    HAL_GPIO_DeInit(GPIOC, GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12);
    HAL_NVIC_DisableIRQ(SDMMC1_IRQn);
}

