khofesh/stm32-projects/nucleo-h533re/002_esp_at_sdio/Core/Src/at_sdio/platform/sdio_driver_port.c
void SdioPortIrqHandler(void)
{
    HAL_SDIO_IRQHandler(&hsdio1);
}

/* R4 carries no CRC and its command-index field is all ones, so a correctly
   framed response always reads back RESPCMD = 0x3F. Any other value means the
   CPSM latched the frame at the wrong bit position. */
#define SDIO_R4_RESPCMD         0x3FU
/* OCR bits 6:0 are reserved and always read 0 in a valid R4 */
#define SDIO_R4_OCR_RSVD_MSK    0x0000007FU

/* Every cell of the probe matrix repeats CMD5 this many times. A link that
   answers some of the time is intermittent - a resistive joint or a marginal
   jumper - which no single-shot test can tell apart from a dead one. */
#define SDIO_PROBE_REPEAT       8U

static const uint32_t sdio_probe_speed[] = {
    GPIO_SPEED_FREQ_VERY_HIGH,
    GPIO_SPEED_FREQ_HIGH,
    GPIO_SPEED_FREQ_MEDIUM,
    GPIO_SPEED_FREQ_LOW,
};
static const char *const sdio_probe_speed_name[] = { "vhigh", "high", "med", "low" };
#define SDIO_PROBE_SPEED_COUNT  (sizeof(sdio_probe_speed) / sizeof(sdio_probe_speed[0]))

/**
  * @brief Re-mux the six SDMMC nets with a different output slew rate.
  */
static void SdioSetPadSpeed(uint32_t speed)
{
    GPIO_InitTypeDef gpio = {0};

    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = speed;
    gpio.Alternate = GPIO_AF12_SDMMC1;

    gpio.Pin = GPIO_PIN_13;
    HAL_GPIO_Init(GPIOB, &gpio);

    gpio.Pin = GPIO_PIN_2;
#if (SDIO_PORT_CMD_OPEN_DRAIN != 0)
    gpio.Mode = GPIO_MODE_AF_OD;
#endif
    HAL_GPIO_Init(GPIOB, &gpio);

    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pin = GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12;
    HAL_GPIO_Init(GPIOC, &gpio);
}

/**
  * @brief CMD0 then CMD5 driven by hand, with the SDMMC out of the picture.
  *
  * Every host-side explanation for the timeout has been ruled out with the CPSM
  * in the loop, which still leaves three things it could be hiding: the edge the
  * frame is driven on, the 64-clock window the CPSM gives up after, and whether
  * the CPSM releases CMD in time for the slave to answer at all. Bit-banging
  * removes all three. The clock is ~25 kHz and the response window is 200 clocks
  * instead of 64, so anything the slave sends will be caught.
  *
  * A response here with none from the CPSM is a host configuration bug. Silence
  * here too means the slave is not decoding the frame, and no host setting will
  * fix that.
  */
/* Half-period in core cycles at 250 MHz; 5000 = 25 kHz, 312 = 400 kHz */
static uint32_t sdio_bb_half_cycles = 5000U;

/* Idle clocks sent with CMD high before CMD0. The SD spec wants at least 74
   after power-up; the question is whether the slave insists on them. */
static uint32_t sdio_bb_idle_clocks = 80U;

/* Result of the same probe with the idle clocks suppressed */
volatile uint32_t sdio_bb_noidle = 0U;

/* Enumeration outcome, as a magic value so it is recognisable in a raw memory
   dump even if the symbol table and the running image disagree on layout. */
#define SDIO_MARK_ENUM_OK    0xC0FFEE01U
#define SDIO_MARK_DRIVER_OK  0xC0FFEE02U
#define SDIO_MARK_ENUM_FAIL  0xDEAD0001U
volatile uint32_t sdio_enum_mark = 0U;

/* How far SdioIdentifyCardSlow() got on its last run: 1 entered, 2 CMD0 ok,
   3 inquiry CMD5 ok, 4 slave reported ready, 5 CMD3 ok, 6 CMD7 ok. */
volatile uint32_t sdio_ident_step = 0U;
volatile uint32_t sdio_ident_resp4 = 0U;
volatile uint32_t sdio_enum_retries = 0U;

/* Mirrored out of the log so the result can be read over SWD when the VCP is
   taken: [0] 0=not run 1=answered 2=silent, [1] clocks to the start bit,
   [2]/[3] the R4 bytes. Not static - it has to survive into the map file. */
volatile uint32_t sdio_bb_result[4] = {0U, 0U, 0U, 0U};

/* Answer count per CLKCR phase combination, same reason. Index is
   bit0 = NEGEDGE, bit1 = HWFC_EN. */
volatile uint32_t sdio_phase_result[4] = {0U, 0U, 0U, 0U};

/* Bit-banged CMD5 answered (1) or not (0) at 25/50/100/200/400 kHz. Finds the
   clock the interconnect actually stops carrying, which the CPSM cannot reach:
   its slowest cell is 122 kHz off a 250 MHz kernel clock. */
volatile uint32_t sdio_bb_freq_khz[8] = {0U};
volatile uint32_t sdio_bb_freq_ok[8] = {0U};

static void SdioBbDelay(void)
{
    uint32_t start = DWT->CYCCNT;

    while ((DWT->CYCCNT - start) < sdio_bb_half_cycles) {
    }
}

static uint8_t SdioCrc7(const uint8_t *data, uint32_t len)
{
    uint8_t crc = 0U;
    uint32_t i;
    uint32_t j;

    for (i = 0U; i < len; i++) {
        uint8_t b = data[i];

        for (j = 0U; j < 8U; j++) {
            crc = (uint8_t)(crc << 1);
            if (((b ^ crc) & 0x80U) != 0U) {
                crc ^= 0x09U;
            }
            b = (uint8_t)(b << 1);
        }
    }

    return (uint8_t)(crc & 0x7FU);
}

/* CMD is driven while CK is low, so the slave latches it on the rising edge -
   the "send at negedge, sample at posedge" default the ESP slave documents. */
static void SdioBbClock(uint32_t cmd_bit)
{
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_2, (cmd_bit != 0U) ? GPIO_PIN_SET : GPIO_PIN_RESET);
    SdioBbDelay();
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_12, GPIO_PIN_SET);
    SdioBbDelay();
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_12, GPIO_PIN_RESET);
}

static void SdioBbSendFrame(uint8_t index, uint32_t arg)
{
    uint8_t frame[6];
    uint32_t i;
    uint32_t j;

    frame[0] = (uint8_t)(0x40U | (index & 0x3FU));
    frame[1] = (uint8_t)(arg >> 24);
    frame[2] = (uint8_t)(arg >> 16);
    frame[3] = (uint8_t)(arg >> 8);
    frame[4] = (uint8_t)arg;
    frame[5] = (uint8_t)((SdioCrc7(frame, 5U) << 1) | 1U);

    for (i = 0U; i < 6U; i++) {
        for (j = 0U; j < 8U; j++) {
            SdioBbClock((uint32_t)(frame[i] >> (7U - j)) & 1U);
        }
    }
}

static void SdioBitBangProbe(void)
{
    GPIO_InitTypeDef gpio = {0};
    uint32_t i;
    uint32_t start_clk = 0U;
    uint32_t got_start = 0U;
    uint8_t  resp[6] = {0};

    /* Free-running cycle counter for the sub-millisecond delays */
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0U;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

    if ((DWT->CTRL & DWT_CTRL_CYCCNTENA_Msk) == 0U) {
        SDIO_LOGE(TAG, "bitbang: no cycle counter, skipped");
        return;
    }

