khofesh/stm32-projects/nucleo-h533re/002_esp_at_sdio/Core/Src/at_sdio/platform/sdio_driver_port.c
    gpio.Mode  = GPIO_MODE_OUTPUT_PP;
    gpio.Pull  = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;
    gpio.Pin   = GPIO_PIN_12;
    HAL_GPIO_Init(GPIOC, &gpio);
    gpio.Pin   = GPIO_PIN_2;
    HAL_GPIO_Init(GPIOB, &gpio);

    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_12, GPIO_PIN_RESET);

    /* Idle clocks with CMD high, as the card expects before CMD0 */
    for (i = 0U; i < sdio_bb_idle_clocks; i++) {
        SdioBbClock(1U);
    }

    SdioBbSendFrame(0U, 0U);          /* CMD0 - no response expected */
    for (i = 0U; i < 16U; i++) {
        SdioBbClock(1U);
    }

    SdioBbSendFrame(5U, 0U);          /* CMD5 - R4 */

    /* Release CMD to the pull-up so the slave can drive it */
    gpio.Mode = GPIO_MODE_INPUT;
    gpio.Pull = GPIO_NOPULL;
    gpio.Pin  = GPIO_PIN_2;
    HAL_GPIO_Init(GPIOB, &gpio);

    for (i = 0U; i < 200U; i++) {
        SdioBbDelay();
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_12, GPIO_PIN_SET);
        SdioBbDelay();
        if (HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_2) == GPIO_PIN_RESET) {
            got_start = 1U;
            start_clk = i;
        }
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_12, GPIO_PIN_RESET);
        if (got_start != 0U) {
            break;
        }
    }

    if (got_start != 0U) {
        /* Start bit already consumed; take the remaining 47 of the R4 frame */
        for (i = 0U; i < 47U; i++) {
            SdioBbDelay();
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_12, GPIO_PIN_SET);
            SdioBbDelay();
            if (HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_2) != GPIO_PIN_RESET) {
                resp[(i + 1U) / 8U] |= (uint8_t)(0x80U >> ((i + 1U) % 8U));
            }
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_12, GPIO_PIN_RESET);
        }

        sdio_bb_result[0] = 1U;
        sdio_bb_result[1] = start_clk;
        sdio_bb_result[2] = ((uint32_t)resp[0] << 24) | ((uint32_t)resp[1] << 16) |
                            ((uint32_t)resp[2] << 8) | (uint32_t)resp[3];
        sdio_bb_result[3] = ((uint32_t)resp[4] << 8) | (uint32_t)resp[5];

        SDIO_LOGE(TAG, "bitbang: slave answered CMD5 after %lu clocks - "
                       "%02x %02x %02x %02x %02x %02x",
                  (unsigned long)start_clk, resp[0], resp[1], resp[2],
                  resp[3], resp[4], resp[5]);
        SDIO_LOGE(TAG, "  the slave decodes a hand-built frame, so the fault is "
                       "in the SDMMC setup, not the link");
    } else {
        sdio_bb_result[0] = 2U;
        SDIO_LOGE(TAG, "bitbang: no start bit in 200 clocks after CMD5");
        SDIO_LOGE(TAG, "  the slave ignores a frame built by hand at 25 kHz with "
                       "a 200-clock window, so it is not decoding CMD at all - "
                       "stop tuning the host");
    }

    SdioSetPadSpeed(SDIO_PORT_GPIO_SPEED);
}

/**
  * @brief Frame-alignment verdict on one R4.
  *
  * The host's shift register always clocks exactly 32 times, so it cannot lose
  * bits: a response that arrives short means the slave advanced its output
  * early, i.e. it saw CK edges the host never issued. RESPCMD says whether the
  * drift had already started by the index field (0x3F = still aligned there),
  * and the trailing reserved ones shifted into the bottom of RESP1 say how many
  * clocks were lost by the end.
  *
  * The NF field is not usable as a verdict - it is one of the first bits to be
  * pushed out, which is why a glitching bus reads as "0 IO functions".
  */
static void SdioReportAlignment(uint32_t resp4, uint32_t respcmd)
{
    uint32_t k;

    if ((respcmd == SDIO_R4_RESPCMD) && ((resp4 & SDIO_R4_OCR_RSVD_MSK) == 0U)) {
        SDIO_LOGE(TAG, "    frame aligned, nf=%lu, OCR=0x%06lx",
                  (unsigned long)((resp4 & 0x70000000U) >> 28U),
                  (unsigned long)(resp4 & 0x00FFFFFFU));
        return;
    }

    for (k = 1U; k < 8U; k++) {
        if (((resp4 & ((1UL << k) - 1UL)) == ((1UL << k) - 1UL)) &&
            (((resp4 >> k) & SDIO_R4_OCR_RSVD_MSK) == 0U)) {
            SDIO_LOGE(TAG, "    slave saw %lu extra CK edge(s) during the "
                           "response (resp = R4<<%lu); OCR=0x%06lx recovered, "
                           "NF lost off the top, index field %s",
                      (unsigned long)k, (unsigned long)k,
                      (unsigned long)((resp4 >> k) & 0x00FFFFFFU),
                      (respcmd == SDIO_R4_RESPCMD) ? "still intact (drift began "
                                                     "in the payload)"
                                                   : "already short (drift began "
                                                     "before the payload)");
            return;
        }
    }
    SDIO_LOGE(TAG, "    corrupt - no single clock count fits the frame");
}

static uint32_t sdio_probe_answered;

/**
  * @brief One matrix cell: SDIO_PROBE_REPEAT x CMD5 at a fixed slew and CLKDIV.
  */
static void SdioProbeCmd5(uint32_t clkdiv, uint32_t arg, const char *speed_name)
{
    uint32_t i;
    uint32_t resp4 = 0U;
    uint32_t first = 0U;
    uint32_t last = 0U;
    uint32_t respcmd = 0U;
    uint32_t answered = 0U;
    uint32_t varies = 0U;

    MODIFY_REG(hsdio1.Instance->CLKCR, SDMMC_CLKCR_CLKDIV, clkdiv);
    HAL_Delay(2U);
    (void)SDMMC_CmdGoIdleState(hsdio1.Instance);
    HAL_Delay(2U);

    for (i = 0U; i < SDIO_PROBE_REPEAT; i++) {
        resp4 = 0U;
        if (SDMMC_CmdSendOperationcondition(hsdio1.Instance, arg, &resp4) == 0U) {
            if (answered == 0U) {
                first = resp4;
                respcmd = hsdio1.Instance->RESPCMD & 0x3FU;
            } else if (resp4 != first) {
                varies = 1U;
            }
            last = resp4;
            answered++;
        }
        HAL_Delay(1U);
    }

    sdio_probe_answered = answered;

    SDIO_LOGE(TAG, "  pads=%-5s div=%-4lu arg=0x%08lx answered=%lu/%u "
                   "respcmd=0x%02lx resp=0x%08lx",
              speed_name, (unsigned long)clkdiv, (unsigned long)arg,
              (unsigned long)answered, (unsigned int)SDIO_PROBE_REPEAT,
              (unsigned long)respcmd, (unsigned long)first);

