khofesh/stm32-projects/nucleo-h533re/002_esp_at_sdio/Core/Src/at_sdio/platform/sdio_driver_port.c
    SDIO_LOGE(TAG, "pin diag: pull-up census (expect 'high' on CMD and D0-D3)");
    for (i = 0U; i < SDIO_PIN_COUNT; i++) {
        GPIO_PinState with_pd;
        GPIO_PinState with_pu;

        if (sdio_pins[i].has_pullup == 0U) {
            continue;
        }

        with_pd = SdioPinRead(&sdio_pins[i], GPIO_PULLDOWN);
        with_pu = SdioPinRead(&sdio_pins[i], GPIO_PULLUP);

        if (with_pd == GPIO_PIN_SET) {
            /* A hard short to 3V3 reads the same here; the matrix separates them */
            SDIO_LOGE(TAG, "  %s: high  (something pulls this net up)",
                      sdio_pins[i].name);
        } else if (with_pu == GPIO_PIN_SET) {
            floating++;
            SDIO_LOGE(TAG, "  %s: FLOAT (no external pull-up - open wire or "
                           "missing resistor)", sdio_pins[i].name);
        } else {
            SDIO_LOGE(TAG, "  %s: LOW   (net shorted to GND)", sdio_pins[i].name);
        }
    }

    SDIO_LOGE(TAG, "pin diag: short matrix");
    for (i = 0U; i < SDIO_PIN_COUNT; i++) {
        for (j = 0U; j < SDIO_PIN_COUNT; j++) {
            if (j != i) {
                SdioPinMode(&sdio_pins[j], GPIO_MODE_INPUT, GPIO_PULLUP);
            }
        }

        SdioPinMode(&sdio_pins[i], GPIO_MODE_OUTPUT_PP, GPIO_NOPULL);
        HAL_GPIO_WritePin(sdio_pins[i].port, sdio_pins[i].pin, GPIO_PIN_RESET);
        HAL_Delay(2U);

        if (HAL_GPIO_ReadPin(sdio_pins[i].port, sdio_pins[i].pin) != GPIO_PIN_RESET) {
            uint32_t pos = (uint32_t)(31 - __CLZ((uint32_t)sdio_pins[i].pin));

            stuck++;
            /* Separate "the pad is really being driven and loses" from "the
               config write never landed" (GTZC/SECCFGR, missing clock, LCKR) */
            SDIO_LOGE(TAG, "  %s: driven low but reads high - MODER=%lu ODR=%lu "
                           "OTYPER=%lu PUPDR=%lu",
                      sdio_pins[i].name,
                      (unsigned long)((sdio_pins[i].port->MODER >> (2U * pos)) & 3U),
                      (unsigned long)((sdio_pins[i].port->ODR >> pos) & 1U),
                      (unsigned long)((sdio_pins[i].port->OTYPER >> pos) & 1U),
                      (unsigned long)((sdio_pins[i].port->PUPDR >> (2U * pos)) & 3U));
        }

        for (j = 0U; j < SDIO_PIN_COUNT; j++) {
            if ((j != i) &&
                (HAL_GPIO_ReadPin(sdio_pins[j].port, sdio_pins[j].pin) == GPIO_PIN_RESET)) {
                SDIO_LOGE(TAG, "  %s shorted to %s", sdio_pins[i].name, sdio_pins[j].name);
            }
        }

        HAL_GPIO_WritePin(sdio_pins[i].port, sdio_pins[i].pin, GPIO_PIN_SET);
        HAL_Delay(2U);
    }

    /* Leave everything as a plain input; HAL_SDIO_MspInit() muxes the AF back on */
    for (i = 0U; i < SDIO_PIN_COUNT; i++) {
        SdioPinMode(&sdio_pins[i], GPIO_MODE_INPUT, GPIO_NOPULL);
    }

    if (stuck != 0U) {
        /* MODER=1/ODR=0/OTYPER=0 in the lines above means the pad really is a
           push-pull output driving low, so only a low impedance path to 3V3 can
           hold the net high - a bridged or mis-wired pull-up, not a 10k one.
           The host cannot assert CMD in this state, which is the CMD5 timeout. */
        SDIO_LOGE(TAG, "pin diag: %lu net(s) tied hard to 3V3 - the host cannot "
                       "drive them at all; rework the pull-ups before blaming "
                       "the slave", (unsigned long)stuck);
    } else if (floating != 0U) {
        SDIO_LOGE(TAG, "pin diag: %lu net(s) floating - fix the wiring before "
                       "reading anything into the CMD5 timeout",
                  (unsigned long)floating);
    } else {
        SDIO_LOGE(TAG, "pin diag: wiring looks sane from the host side");
    }

    return stuck + floating;
}
#endif /* SDIO_PORT_PIN_DIAG */

#if (SDIO_PORT_CK_TOGGLE_MS != 0)
/**
  * @brief Square wave on CK and CMD, slow enough for a meter or logic probe.
  *
  * Proves the host really drives PC12/PB2 and that the far end sees them,
  * which the SDMMC at 400 kHz cannot demonstrate without an analyser.
  */
static void SdioToggleCk(void)
{
    /* One net at a time, so whoever is watching the slave can tell which host
       pin a given ESP32-C6 pad is actually wired to. Expected far end:
       CK->GPIO19, CMD->GPIO18, D0->GPIO20, D1->GPIO21, D2->GPIO22, D3->GPIO23 */
    static const struct {
        const char   *name;
        const char   *far_end;
        GPIO_TypeDef *port;
        uint16_t      pin;
    } sweep[] = {
        { "CK(PC12)",  "GPIO19", GPIOC, GPIO_PIN_12 },
        { "CMD(PB2)",  "GPIO18", GPIOB, GPIO_PIN_2  },
        { "D0(PB13)",  "GPIO20", GPIOB, GPIO_PIN_13 },
        { "D1(PC9)",   "GPIO21", GPIOC, GPIO_PIN_9  },
        { "D2(PC10)",  "GPIO22", GPIOC, GPIO_PIN_10 },
        { "D3(PC11)",  "GPIO23", GPIOC, GPIO_PIN_11 },
    };
    GPIO_InitTypeDef gpio = {0};
    uint32_t i;
    uint32_t end;

    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();

    gpio.Mode = GPIO_MODE_OUTPUT_PP;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;

    for (i = 0U; i < (sizeof(sweep) / sizeof(sweep[0])); i++) {
        gpio.Pin = sweep[i].pin;
        HAL_GPIO_Init(sweep[i].port, &gpio);
        HAL_GPIO_WritePin(sweep[i].port, sweep[i].pin, GPIO_PIN_SET);

        SDIO_LOGE(TAG, "sweep: %s alone at 2 Hz for %u ms - expect it at "
                       "ESP32-C6 %s", sweep[i].name,
                  (unsigned int)SDIO_PORT_CK_TOGGLE_MS, sweep[i].far_end);

        end = HAL_GetTick() + SDIO_PORT_CK_TOGGLE_MS;
        while (HAL_GetTick() < end) {
            HAL_GPIO_TogglePin(sweep[i].port, sweep[i].pin);
            HAL_Delay(250U);
        }

        /* Release the net (pull-ups take it high) and leave a quiet gap so the
           next window is unambiguous */
        HAL_GPIO_WritePin(sweep[i].port, sweep[i].pin, GPIO_PIN_SET);
        gpio.Mode = GPIO_MODE_INPUT;
        HAL_GPIO_Init(sweep[i].port, &gpio);
        gpio.Mode = GPIO_MODE_OUTPUT_PP;
        HAL_Delay(1500U);
    }
}
#endif /* SDIO_PORT_CK_TOGGLE_MS */

/**
  * @brief Agree the data bus width with the slave once enumeration has completed.
  *
  * HAL_SDIO_Init() compares hsdio->Init.BusWide (an SDMMC_BUS_WIDE_* register
  * value) against HAL_SDIO_4_WIRES_MODE (1), so what it writes into CCCR 0x07
  * has nothing to do with the width actually asked for. The setting is made
  * here instead: CMD52 travels on CMD only, so it is unaffected by the width,
  * and CLKCR is moved only after the slave has acknowledged the new value.
  *
  * The 1-bit case is written out too rather than assumed. A slave that was left
  * in 4-bit by a previous host session keeps that setting until it is reset, and
  * a host that has meanwhile dropped to 1-bit would then read nothing but data
  * CRC failures.
  */
static sdio_err_t SdioSetBusWidth(void)
{
#if (SDIO_PORT_BUS_WIDTH == HAL_SDIO_4_WIRES_MODE)
    const uint8_t want = SDIO_CCCR_BUS_WIDTH_4B;
    const uint32_t widbus = SDMMC_BUS_WIDE_4B;
#else
    const uint8_t want = SDIO_CCCR_BUS_WIDTH_1B;
    const uint32_t widbus = SDMMC_BUS_WIDE_1B;
#endif
    uint8_t val;

    if (sdio_driver_read_byte(0U, SDIO_CCCR_BUS_IF_CTRL, &val) != SDIO_SUCCESS) {
        SDIO_LOGE(TAG, "CCCR 0x07 read failed");
        return FAILURE;
    }

