khofesh/stm32-projects/nucleo-h533re/002_esp_at_sdio/Core/Src/at_sdio/platform/sdio_driver_port.c
    val = (uint8_t)((val & ~SDIO_CCCR_BUS_WIDTH_MSK) | want);
    if (sdio_driver_write_byte(0U, SDIO_CCCR_BUS_IF_CTRL, val, &val) != SDIO_SUCCESS) {
        SDIO_LOGE(TAG, "CCCR 0x07 write failed");
        return FAILURE;
    }

    if ((val & SDIO_CCCR_BUS_WIDTH_MSK) != want) {
        SDIO_LOGE(TAG, "slave refused %u-bit, CCCR 0x07 = 0x%02x",
                  (want == SDIO_CCCR_BUS_WIDTH_4B) ? 4U : 1U, (unsigned int)val);
        return FAILURE;
    }

    MODIFY_REG(hsdio1.Instance->CLKCR, SDMMC_CLKCR_WIDBUS, widbus);
    hsdio1.Init.BusWide = widbus;

    SDIO_LOGI(TAG, "bus width set to %u-bit",
              (want == SDIO_CCCR_BUS_WIDTH_4B) ? 4U : 1U);
    return SDIO_SUCCESS;
}

/* CMD5 argument: 3.2-3.3V window, no 1.8V switch request */
#define SDIO_IDENT_OCR_VDD_32_33  (1UL << 20U)

/* Per-command retries inside identification. The link drops frames at a low
   rate; retrying the command is far cheaper than restarting enumeration. */
#define SDIO_IDENT_CMD_RETRY      32U

/**
  * @brief Replacement for the HAL identification step, run at the port's clock.
  *
  * HAL_SDIO_Init() recomputes Init.ClockDiv from its private SDIO_INIT_FREQ
  * (400 kHz) and enumerates there, throwing away hsdio1.Init.ClockDiv - it only
  * restores it after identification succeeds. This link does not carry a frame
  * at 400 kHz: the bit-banged probe reads a valid R4 at 25 kHz and nothing at
  * 400 kHz, which is why every clock, slew and phase sweep changed nothing. They
  * were all outside the window the HAL re-initialises.
  *
  * SDIO_IdentifyCard is a documented hook and the HAL only defaults it when it
  * is NULL, so this runs the same CMD0/CMD5/CMD3/CMD7 sequence with the clock
  * put back to SDIO_PORT_CLOCK_HZ first, plus the 74 idle cycles the slave turns
  * out to insist on - a bit-banged CMD5 with them is answered, without them it
  * is not.
  */
static HAL_StatusTypeDef SdioIdentifyCardSlow(SDIO_HandleTypeDef *hsdio)
{
    uint32_t errorstate;
    uint32_t resp4 = 0U;
    uint32_t timeout;
    uint16_t rca = 1U;

    sdio_ident_step = 1U;

    /* Undo the HAL's 400 kHz and give the slave its power-up clocks at ours */
    MODIFY_REG(hsdio->Instance->CLKCR, SDMMC_CLKCR_CLKDIV, hsdio->Init.ClockDiv);
    HAL_Delay(1U + (74U * 1000U / SDIO_PORT_CLOCK_HZ) + 1U);

    for (timeout = 0U; timeout < SDIO_IDENT_CMD_RETRY; timeout++) {
        if (SDMMC_CmdGoIdleState(hsdio->Instance) == HAL_SDIO_ERROR_NONE) {
            break;
        }
        HAL_Delay(2U);
    }

    if (timeout >= SDIO_IDENT_CMD_RETRY) {
        return HAL_ERROR;
    }

    sdio_ident_step = 2U;

    if (SDMMC_GetPowerState(hsdio->Instance) == 0U) {
        return HAL_ERROR;
    }

    /* Inquiry CMD5 - arg 0 never sets C, it only reports the OCR.

       Retried here rather than upwards: a single timed-out command used to fail
       the whole HAL_SDIO_Init(), which tears the card back down to RESET and
       re-runs CMD0 from scratch. On a link that drops the occasional frame that
       turns a recoverable hiccup into a total failure, and the step markers show
       exactly that - runs that failed at this command had already seen a ready
       R4 from an earlier attempt in the same batch. */
    for (timeout = 0U; timeout < SDIO_IDENT_CMD_RETRY; timeout++) {
        if (SDMMC_CmdSendOperationcondition(hsdio->Instance, 0U, &resp4) ==
            HAL_SDIO_ERROR_NONE) {
            break;
        }
        HAL_Delay(2U);
        (void)SDMMC_CmdGoIdleState(hsdio->Instance);
        HAL_Delay(2U);
    }

    if (timeout >= SDIO_IDENT_CMD_RETRY) {
        return HAL_ERROR;
    }

    sdio_ident_step = 3U;
    sdio_ident_resp4 = resp4;

    if (((resp4 & 0x70000000U) >> 28U) == 0U) {
        return HAL_ERROR;      /* no I/O function - not an SDIO card */
    }

    /* Now poll with the voltage window until the slave reports ready. The HAL
       asks once and gives up, which loses the race whenever the slave is still
       initialising. */
    for (timeout = 0U; timeout < 1000U; timeout++) {
        if (SDMMC_CmdSendOperationcondition(hsdio->Instance,
                                            SDIO_IDENT_OCR_VDD_32_33,
                                            &resp4) == HAL_SDIO_ERROR_NONE) {
            if ((resp4 & 0x80000000U) != 0U) {
                break;
            }
        }
        HAL_Delay(1U);
    }

    if ((resp4 & 0x80000000U) == 0U) {
        return HAL_ERROR;
    }

    sdio_ident_step = 4U;
    sdio_ident_resp4 = resp4;

    /* CMD0 before CMD3 makes CMD3 illegal for a while; the HAL retries and so
       does this. */
    timeout = 0U;
    do {
        errorstate = SDMMC_CmdSetRelAdd(hsdio->Instance, &rca);
        timeout++;
        HAL_Delay(1U);
    } while ((errorstate != HAL_SDIO_ERROR_NONE) && (timeout < 1000U));

    if (errorstate != HAL_SDIO_ERROR_NONE) {
        return HAL_ERROR;
    }

    sdio_ident_step = 5U;

    for (timeout = 0U; timeout < SDIO_IDENT_CMD_RETRY; timeout++) {
        if (SDMMC_CmdSelDesel(hsdio->Instance, ((uint32_t)rca) << 16U) ==
            HAL_SDIO_ERROR_NONE) {
            break;
        }
        HAL_Delay(2U);
    }

    if (timeout >= SDIO_IDENT_CMD_RETRY) {
        return HAL_ERROR;
    }

    sdio_ident_step = 6U;
    return HAL_OK;
}

sdio_err_t sdio_driver_init(void)
{
    uint32_t kernel_clk;
    uint32_t retry;
    HAL_StatusTypeDef status = HAL_ERROR;

#if (SDIO_PORT_ESP_RST_BOOT_MS != 0)
    /* Before anything touches the bus, so the slave is always freshly booted */
    SdioResetSlaveHw();
#endif

    /* The sweep runs first: it is the only test that says where a wire actually
       lands, and a net the census rejects is exactly when that matters most */
#if (SDIO_PORT_CK_TOGGLE_MS != 0)
    SdioToggleCk();
#endif
#if (SDIO_PORT_PIN_DIAG != 0)
    /* No point clocking the bus when the host cannot even assert CMD */
    if (SdioPinDiag() != 0U) {
        return FAILURE;
    }
#endif

    if (SdioKernelClockConfig() != HAL_OK) {
        SDIO_LOGE(TAG, "SDMMC1 kernel clock config failed");
        return FAILURE;
    }

    kernel_clk = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_SDMMC1);
    if (kernel_clk == 0U) {
        SDIO_LOGE(TAG, "SDMMC1 kernel clock is 0");
        return FAILURE;
    }

    hsdio1.Instance = SDMMC1;
    hsdio1.Init.ClockEdge = SDMMC_CLOCK_EDGE_RISING;
    hsdio1.Init.ClockPowerSave = SDMMC_CLOCK_POWER_SAVE_DISABLE;
    /* Enumerate in 1-bit; SdioSetBusWidth4() widens the link afterwards */
    hsdio1.Init.BusWide = SDMMC_BUS_WIDE_1B;
    hsdio1.Init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_DISABLE;
    /* SDMMC_CK = kernel_clk / (2 * ClockDiv); ClockDiv is 10 bits */
    hsdio1.Init.ClockDiv = kernel_clk / (2U * SDIO_PORT_CLOCK_HZ);
    if (hsdio1.Init.ClockDiv > 0x3FFU) {
        hsdio1.Init.ClockDiv = 0x3FFU;
    }

    SDIO_LOGI(TAG, "[Clock] kernel=%luHz, div=%lu, SDMMC_CK=%luHz",
              (unsigned long)kernel_clk, (unsigned long)hsdio1.Init.ClockDiv,
              (unsigned long)(hsdio1.Init.ClockDiv ? kernel_clk / (2U * hsdio1.Init.ClockDiv)
                                                   : kernel_clk));

    /* Runs the CMD0/CMD5/CMD3/CMD7 enumeration and sets the CCCR bus width.
       A failed attempt leaves State back at RESET, so re-calling it is a clean
       restart of the whole sequence. */
    /* Claim the identification step before the HAL can default it */
    hsdio1.SDIO_IdentifyCard = SdioIdentifyCardSlow;

