khofesh/stm32-projects/nucleo-h533re/002_esp_at_sdio/Core/Src/at_sdio/platform/sdio_driver_port.c
    for (retry = 0U; retry < SDIO_INIT_RETRY_COUNT; retry++) {
        status = HAL_SDIO_Init(&hsdio1);
        if (status == HAL_OK) {
            break;
        }
        SdioResetSlaveIo();
        HAL_Delay(SDIO_INIT_RETRY_MS);
    }

    sdio_enum_retries = retry;
    sdio_enum_mark = (status == HAL_OK) ? SDIO_MARK_ENUM_OK : SDIO_MARK_ENUM_FAIL;

    if (status != HAL_OK) {
        /* SDIO_InitCard() returns HAL_ERROR without recording an ErrorCode, so
           re-probe CMD0/CMD5 here to say which half of the link is at fault. */
        SDIO_LOGE(TAG, "HAL_SDIO_Init failed after %lu attempts, err=0x%08lx",
                  (unsigned long)SDIO_INIT_RETRY_COUNT,
                  (unsigned long)HAL_SDIO_GetError(&hsdio1));
        SdioProbeSlave();
        return FAILURE;
    }

    if (retry > 0U) {
        SDIO_LOGI(TAG, "slave enumerated after %lu retries (%lu ms)",
                  (unsigned long)retry,
                  (unsigned long)(retry * SDIO_INIT_RETRY_MS));
    }

    /* Everything below is a CMD52 on the same link that loses the occasional
       frame during identification, and a single miss here used to fail the whole
       init even though enumeration had succeeded. Same answer as there: retry
       the command rather than the sequence. */
    for (retry = 0U; retry < SDIO_IDENT_CMD_RETRY; retry++) {
        if (SdioSetBusWidth() == SDIO_SUCCESS) {
            break;
        }
        HAL_Delay(2U);
    }

    if (retry >= SDIO_IDENT_CMD_RETRY) {
        SDIO_LOGE(TAG, "set bus width failed");
        return FAILURE;
    }

    if (HAL_SDIO_RegisterIOFunctionCallback(&hsdio1, SDIO_PORT_FUNCTION,
                                            EspIoInterruptCallback) != HAL_OK) {
        return FAILURE;
    }

    for (retry = 0U; retry < SDIO_IDENT_CMD_RETRY; retry++) {
        if (HAL_SDIO_EnableIOFunction(&hsdio1, SDIO_PORT_FUNCTION) == HAL_OK) {
            break;
        }
        HAL_Delay(2U);
    }

    if (retry >= SDIO_IDENT_CMD_RETRY) {
        SDIO_LOGE(TAG, "enable IO function 1 failed");
        return FAILURE;
    }

    for (retry = 0U; retry < SDIO_IDENT_CMD_RETRY; retry++) {
        if (HAL_SDIO_SetBlockSize(&hsdio1, SDIO_PORT_FUNCTION,
                                  SDIO_PORT_BLOCK_SIZE) == HAL_OK) {
            break;
        }
        HAL_Delay(2U);
    }

    if (retry >= SDIO_IDENT_CMD_RETRY) {
        SDIO_LOGE(TAG, "set block size failed");
        return FAILURE;
    }

    for (retry = 0U; retry < SDIO_IDENT_CMD_RETRY; retry++) {
        if (HAL_SDIO_EnableIOFunctionInterrupt(&hsdio1, SDIO_PORT_FUNCTION) == HAL_OK) {
            break;
        }
        HAL_Delay(2U);
    }

    if (retry >= SDIO_IDENT_CMD_RETRY) {
        SDIO_LOGE(TAG, "enable IO function 1 interrupt failed");
        return FAILURE;
    }

    sdio_enum_mark = SDIO_MARK_DRIVER_OK;
    return SDIO_SUCCESS;
}

sdio_err_t sdio_driver_read_byte(uint32_t function, uint32_t reg, uint8_t *out_byte)
{
    HAL_SDIO_DirectCmd_TypeDef cmd52;

    cmd52.Reg_Addr = reg;
    cmd52.ReadAfterWrite = 0U;
    cmd52.IOFunctionNbr = function & 0x7U;

    if (HAL_SDIO_ReadDirect(&hsdio1, &cmd52, out_byte) != HAL_OK) {
        SDIO_LOGE(TAG, "CMD52 read error, func %lu reg 0x%lx",
                  (unsigned long)function, (unsigned long)reg);
        return FAILURE;
    }
    return SDIO_SUCCESS;
}

sdio_err_t sdio_driver_write_byte(uint32_t function, uint32_t reg, uint8_t in_byte,
                                  uint8_t *out_byte)
{
    HAL_SDIO_DirectCmd_TypeDef cmd52;

    cmd52.Reg_Addr = reg;
    cmd52.ReadAfterWrite = 0U;
    cmd52.IOFunctionNbr = function & 0x7U;

    if (HAL_SDIO_WriteDirect(&hsdio1, &cmd52, in_byte) != HAL_OK) {
        SDIO_LOGE(TAG, "CMD52 write error, func %lu reg 0x%lx",
                  (unsigned long)function, (unsigned long)reg);
        return FAILURE;
    }

    /* HAL_SDIO_WriteDirect discards the read-after-write payload, so when the
       caller wants it back issue a plain CMD52 read instead. */
    if (out_byte != NULL) {
        return sdio_driver_read_byte(function, reg, out_byte);
    }
    return SDIO_SUCCESS;
}

static HAL_StatusTypeDef SdioByteReadBlockMode(uint32_t function, uint32_t addr,
                                               uint8_t *buf, uint32_t len,
                                               uint32_t timeout_ms);
static uint32_t SdioCmd53RetryableError(uint32_t err);

/**
  * @brief Put both ends of a failed CMD53 back to a known state.
  *
  * A data phase that ends in DCRCFAIL/DTIMEOUT leaves the slave's function-1
  * data path mid-transfer: it keeps waiting for the bytes it never got, and
  * answers the next CMD53 with COM_CRC_ERROR in R5 rather than the transfer.
  * That is the cascade in the log - one DATA_CRC_FAIL followed by an unbroken
  * run of err=0x1000 - and retrying the command alone can never clear it.
  *
  * CCCR 0x06 (I/O Abort, written by HAL_SDIO_AbortIOFunction) is the defined way
  * out: it aborts the function's transfer and frees the bus. The host side needs
  * the same treatment, hence the FIFO reset and the flag clear.
  */
/**
  * @brief CCCR I/O Abort carrying CMDSTOP: stops the slave and the DPSM at once.
  *
  * A data phase that ends without DATAEND leaves DPSMACT set - the DPSM is still
  * waiting for the bytes that never came - and while it is set, DCTRL and DLEN
  * are read-only. Every transfer after it therefore inherits the stale
  * programming and times out in turn, which is the "DCOUNT=508" (512 minus the
  * four bytes that did arrive) in the failure logs: a 4-byte register read that
  * was never able to load its own length. Rewriting DCTRL, pulsing FIFORST and
  * clearing the flags do not touch it, and neither does a plain CMD52.
  *
  * CMDSTOP is what does: it tells the CPSM this command terminates the data
  * transfer, so the DPSM is torn down with it. The frame it rides on is the
  * CCCR 0x06 write that HAL_SDIO_AbortIOFunction() would have sent anyway, so
  * the slave gets its I/O abort in the same breath. The response is not checked
  * - a slave wedged mid-transfer may not send one, and it acts on the write
  * either way.
  */
static void SdioAbortDataPath(uint32_t function)
{
    SDMMC_CmdInitTypeDef cmd = {0};
    uint32_t tickstart;

    __SDMMC_CMDSTOP_ENABLE(hsdio1.Instance);
    __SDMMC_CMDTRANS_DISABLE(hsdio1.Instance);

    /* R/W=1, function 0, RAW=0, address 0x06 (I/O Abort), data = function no. */
    cmd.Argument         = 0x80000C00U | (function & 0x7U);
    cmd.CmdIndex         = SDMMC_CMD_SDMMC_RW_DIRECT;
    cmd.Response         = SDMMC_RESPONSE_SHORT;
    cmd.WaitForInterrupt = SDMMC_WAIT_NO;
    cmd.CPSM             = SDMMC_CPSM_ENABLE;
    (void)SDMMC_SendCommand(hsdio1.Instance, &cmd);

    tickstart = HAL_GetTick();
    while (((hsdio1.Instance->STA & (SDMMC_FLAG_CMDREND | SDMMC_FLAG_CTIMEOUT |
                                    SDMMC_FLAG_CCRCFAIL)) == 0U) &&
           ((HAL_GetTick() - tickstart) < 20U)) {
    }

    __SDMMC_CMDSTOP_DISABLE(hsdio1.Instance);

    tickstart = HAL_GetTick();
    while (((hsdio1.Instance->STA & SDMMC_FLAG_DPSMACT) != 0U) &&
           ((HAL_GetTick() - tickstart) < 20U)) {
    }

    if ((hsdio1.Instance->STA & SDMMC_FLAG_DPSMACT) != 0U) {
        SDIO_LOGE(TAG, "DPSM still active after abort, STA=0x%08lx DCOUNT=%lu",
                  (unsigned long)hsdio1.Instance->STA,
                  (unsigned long)hsdio1.Instance->DCOUNT);
    }
}

static void SdioRecoverAfterCmd53(uint32_t function)
{
    /* Data path first: nothing below can be reprogrammed until DPSMACT drops */
    SdioAbortDataPath(function);

    /* Now DCTRL is writable again. DTEN and the block size go with the rewrite;
       SDIOEN is the only bit worth keeping. */
    hsdio1.Instance->DCTRL = ((hsdio1.Instance->DCTRL & SDMMC_DCTRL_SDIOEN) != 0U)
                             ? SDMMC_DCTRL_SDIOEN : 0U;

