khofesh/stm32-projects/nucleo-h533re/002_esp_at_sdio/Core/Src/at_sdio/platform/sdio_driver_port.c
    /* FIFORST is not self-clearing: left asserted it holds the receive FIFO in
       reset, so the next transfer's DCOUNT never moves and every following
       CMD53 times out. One failed transfer would otherwise take the link down
       for good. */
    MODIFY_REG(hsdio1.Instance->DCTRL, SDMMC_DCTRL_FIFORST, SDMMC_DCTRL_FIFORST);
    CLEAR_BIT(hsdio1.Instance->DCTRL, SDMMC_DCTRL_FIFORST);
    __SDMMC_CMDTRANS_DISABLE(hsdio1.Instance);
    __HAL_SDIO_CLEAR_FLAG(&hsdio1, SDMMC_STATIC_FLAGS);
    __HAL_SDIO_CLEAR_FLAG(&hsdio1, SDMMC_STATIC_DATA_FLAGS);

    hsdio1.State = HAL_SDIO_STATE_READY;
    hsdio1.Context = SDIO_CONTEXT_NONE;
}

/* A register read is at most one word; anything longer is packet payload and
   has to stay on CMD53 */
#define SDIO_CMD52_FALLBACK_MAX 4U
/* ...and only a register may take it at all. In the packet window at
   ESP_SLAVE_CMD53_END_ADDR the address *is* the transfer length, so splitting a
   read into four CMD52s does not read four bytes of one packet - it asks the
   slave for four different lengths and destroys the queue. Every function-1
   register this driver touches (0x44, 0x50, 0x58, 0x60, 0xd4) is below 0x1000;
   the window is at 0x1f4xx-0x1f800. */
#define SDIO_CMD52_FALLBACK_MAX_ADDR 0x1000U
/* CMD53 attempts before the fallback is tried. The registers that need it fail
   every single time, so waiting out all SDIO_CMD53_RETRY_COUNT of them would
   cost ~60 ms per poll at this clock. */
#define SDIO_CMD52_FALLBACK_AFTER 2U
/* Attempts per byte inside the fallback itself. Kept short - each miss costs a
   CMD52 timeout and a log line, and the fallback only runs on a register. */
#define SDIO_CMD52_BYTE_RETRY     4U

/**
  * @brief Read a slave register a byte at a time with CMD52.
  *
  * Function 1 registers 0x44 (TOKEN_RDATA) and 0x48 answer a CMD53 with a data
  * phase the host's CRC rejects - measured 0/20 good, while 0x40, 0x4c-0x60 are
  * 20/20 and CMD52 returns the same bytes on every attempt. Without the token
  * count the host never believes the slave has a free buffer, so every AT
  * command typed at the console ends in "buffer is not enough: 0, 1 required".
  *
  * CMD52 carries its byte in the response on the CMD line and has no data
  * phase at all, which is why it is unaffected.
  */
static sdio_err_t SdioReadBytesCmd52(uint32_t function, uint32_t addr,
                                     uint8_t *buf, uint32_t len)
{
    uint32_t i;
    uint32_t retry;

    for (i = 0U; i < len; i++) {
        /* The link drops the occasional frame, and this is the last line of
           defence: a single missed CMD52 here fails the whole word read, which
           for the length register at 0x60 aborts the receive drain. */
        for (retry = 0U; retry < SDIO_CMD52_BYTE_RETRY; retry++) {
            if (sdio_driver_read_byte(function, addr + i, &buf[i]) == SDIO_SUCCESS) {
                break;
            }
            HAL_Delay(1U);
        }

        if (retry >= SDIO_CMD52_BYTE_RETRY) {
            return FAILURE;
        }
    }
    return SDIO_SUCCESS;
}

/**
  * @brief Wall-clock budget for one CMD53, from what the transfer must take.
  *
  * A flat second is both too long and too short: at SDIO_PORT_CLOCK_HZ a
  * 512-byte block needs ~164 ms, so a stall costs six times what it should to
  * notice, while a full 4 kB packet legitimately needs more than a second and
  * would be failed while it was still running. Three times the theoretical
  * time, plus a fixed floor for the command and turnaround.
  */
static uint32_t SdioXferTimeoutMs(uint32_t len)
{
    /* 8 clocks per byte on one data line; a 4-bit bus only finishes sooner */
    uint32_t ms = ((len * 8U) / (SDIO_PORT_CLOCK_HZ / 1000U));

    return 50U + (ms * 3U);
}

static sdio_err_t SdioTransfer(uint32_t function, uint32_t addr, void *buffer,
                               uint32_t len, uint32_t block_mode, uint8_t is_write)
{
    HAL_SDIO_ExtendedCmd_TypeDef cmd53;
    HAL_StatusTypeDef status;
    uint32_t retry;
    uint32_t err = HAL_SDIO_ERROR_NONE;

    if ((buffer == NULL) || (len == 0U)) {
        return ERR_INVALID_ARG;
    }
    if (((uintptr_t)buffer & 3U) != 0U) {
        SDIO_LOGE(TAG, "buffer must be 4-byte aligned");
        return ERR_INVALID_ARG;
    }
    if ((block_mode == HAL_SDIO_MODE_BYTE) && (len > SDIO_PORT_MAX_BYTE_XFER)) {
        SDIO_LOGE(TAG, "byte mode transfer too long: %lu", (unsigned long)len);
        return ERR_INVALID_ARG;
    }
    if ((block_mode == HAL_SDIO_MODE_BLOCK) && ((len % SDIO_PORT_BLOCK_SIZE) != 0U)) {
        SDIO_LOGE(TAG, "block mode length %lu not a multiple of %u",
                  (unsigned long)len, (unsigned int)SDIO_PORT_BLOCK_SIZE);
        return ERR_INVALID_ARG;
    }

    cmd53.Reg_Addr = addr;
    cmd53.OpCode = HAL_SDIO_OP_CODE_AUTO_INC;
    cmd53.Block_Mode = block_mode;
    cmd53.IOFunctionNbr = function & 0x7U;

    const uint8_t cmd52_fallback = ((is_write == 0U) &&
                                    (block_mode == HAL_SDIO_MODE_BYTE) &&
                                    (len <= SDIO_CMD52_FALLBACK_MAX) &&
                                    (addr < SDIO_CMD52_FALLBACK_MAX_ADDR)) ? 1U : 0U;

    const uint32_t timeout_ms = SdioXferTimeoutMs(len);

    /* The whole transfer runs with SDMMC1 masked at the NVIC.
     *
     * HAL_SDIO_EnableIOFunctionInterrupt() leaves SDMMC_IT_SDIOIT enabled for
     * good, and STA.SDIOIT simply tracks D1 - so the slave raising its
     * interrupt part way through a data phase, which is exactly what it does
     * when the next packet lands, runs HAL_SDIO_IRQHandler(). That handler
     * reads STA and acts on DATAEND *without checking whether the DATAEND
     * interrupt was ever enabled*: it clears the flag, forces State to READY
     * and disables CMDTRANS. The polled loop inside HAL_SDIO_ReadExtended() /
     * WriteExtended() is then waiting for a flag that has already been taken
     * from it, and gives up with HAL_SDIO_ERROR_TIMEOUT (0x80000000) on a
     * transfer whose data actually moved - no CRC error, no DTIMEOUT. From
     * there the recovery aborts a function that was never stuck and the link
     * stops carrying anything at all.
     *
     * Masking the IRQ loses no interrupt: SDIOIT is a level, not an edge, so
     * it is still asserted when the mask is lifted. */
    HAL_NVIC_DisableIRQ(SDMMC1_IRQn);

    for (retry = 0U; retry < SDIO_CMD53_RETRY_COUNT; retry++) {
        if ((is_write == 0U) && (block_mode == HAL_SDIO_MODE_BYTE)) {
            status = SdioByteReadBlockMode(function, addr, (uint8_t *)buffer, len, timeout_ms);
        } else if (is_write != 0U) {
            status = HAL_SDIO_WriteExtended(&hsdio1, &cmd53, (uint8_t *)buffer, len, timeout_ms);
        } else {
            status = HAL_SDIO_ReadExtended(&hsdio1, &cmd53, (uint8_t *)buffer, len, timeout_ms);
        }

        if (status == HAL_OK) {
            HAL_NVIC_EnableIRQ(SDMMC1_IRQn);
            return SDIO_SUCCESS;
        }

