khofesh/stm32-projects/nucleo-h533re/002_esp_at_sdio/Core/Src/at_sdio/platform/sdio_driver_port.c
        /* Latched before the recovery below, whose CMD52 resets ErrorCode */
        err = HAL_SDIO_GetError(&hsdio1);
        SdioRecoverAfterCmd53(function);

        if ((SdioCmd53RetryableError(err) == 0U) ||
            ((retry + 1U) >= SDIO_CMD53_RETRY_COUNT) ||
            (((err & HAL_SDIO_ERROR_TIMEOUT) != 0U) &&
             ((retry + 1U) >= SDIO_CMD53_TIMEOUT_RETRY)) ||
            ((cmd52_fallback != 0U) && ((retry + 1U) >= SDIO_CMD52_FALLBACK_AFTER))) {
            break;
        }
        HAL_Delay(1U);
    }

    if (cmd52_fallback != 0U) {
        if (SdioReadBytesCmd52(function, addr, (uint8_t *)buffer, len) == SDIO_SUCCESS) {
            HAL_NVIC_EnableIRQ(SDMMC1_IRQn);
            return SDIO_SUCCESS;
        }
    }

    HAL_NVIC_EnableIRQ(SDMMC1_IRQn);

    {
        SDIO_LOGE(TAG, "CMD53 %s error, addr 0x%lx count %lu, err 0x%08lx%s%s%s%s%s%s%s%s",
                  (is_write != 0U) ? "write" : "read", (unsigned long)addr,
                  (unsigned long)len, (unsigned long)err,
                  ((err & SDMMC_ERROR_CMD_CRC_FAIL) != 0U) ? " CMD_CRC_FAIL" : "",
                  ((err & SDMMC_ERROR_CMD_RSP_TIMEOUT) != 0U) ? " CMD_RSP_TIMEOUT" : "",
                  ((err & SDMMC_ERROR_COM_CRC_FAILED) != 0U) ? " R5_COM_CRC" : "",
                  ((err & HAL_SDIO_ERROR_DATA_CRC_FAIL) != 0U) ? " DATA_CRC_FAIL" : "",
                  ((err & HAL_SDIO_ERROR_DATA_TIMEOUT) != 0U) ? " DATA_TIMEOUT" : "",
                  ((err & HAL_SDIO_ERROR_TX_UNDERRUN) != 0U) ? " TX_UNDERRUN" : "",
                  ((err & HAL_SDIO_ERROR_RX_OVERRUN) != 0U) ? " RX_OVERRUN" : "",
                  ((err & HAL_SDIO_ERROR_TIMEOUT) != 0U) ? " TIMEOUT" : "");
        return FAILURE;
    }
}

static uint32_t SdioCmd53RetryableError(uint32_t err)
{
    return ((err & (SDMMC_ERROR_CMD_CRC_FAIL |
                   SDMMC_ERROR_COM_CRC_FAILED |
                   SDMMC_ERROR_CMD_RSP_TIMEOUT |
                   HAL_SDIO_ERROR_DATA_CRC_FAIL |
                   HAL_SDIO_ERROR_DATA_TIMEOUT |
                   HAL_SDIO_ERROR_TIMEOUT)) != 0U) ? 1U : 0U;
}

static uint32_t SdioCmd53Arg(uint32_t function, uint32_t addr, uint32_t len,
                             uint32_t block_mode, uint8_t is_write)
{
    uint32_t arg = (is_write != 0U) ? (1UL << 31U) : 0U;

    arg |= (function & 0x7U) << 28U;
    arg |= (block_mode == HAL_SDIO_MODE_BLOCK) ? (1UL << 27U) : 0U;
    arg |= 1UL << 26U;
    arg |= (addr & 0x1FFFFU) << 9U;
    arg |= len & 0x1FFU;

    return arg;
}

static uint32_t SdioResp5Error(uint32_t r5)
{
    if ((r5 & SDMMC_SDIO_R5_OUT_OF_RANGE) != 0U) {
        return SDMMC_ERROR_ADDR_OUT_OF_RANGE;
    }
    if ((r5 & SDMMC_SDIO_R5_INVALID_FUNCTION_NUMBER) != 0U) {
        return SDMMC_ERROR_INVALID_PARAMETER;
    }
    if ((r5 & SDMMC_SDIO_R5_ILLEGAL_CMD) != 0U) {
        return SDMMC_ERROR_ILLEGAL_CMD;
    }
    if ((r5 & SDMMC_SDIO_R5_COM_CRC_FAILED) != 0U) {
        return SDMMC_ERROR_COM_CRC_FAILED;
    }
    if ((r5 & (SDMMC_SDIO_R5_ERROR | SDMMC_SDIO_R5_GENERAL_UNKNOWN_ERROR)) != 0U) {
        return SDMMC_ERROR_GENERAL_UNKNOWN_ERR;
    }
    return SDMMC_ERROR_NONE;
}

static uint32_t SdioWaitResp5(uint32_t *out_resp)
{
    uint32_t sta;
    uint32_t count = SDMMC_CMDTIMEOUT * (SystemCoreClock / 8U / 1000U);

    do {
        if (count-- == 0U) {
            return SDMMC_ERROR_TIMEOUT;
        }
        sta = hsdio1.Instance->STA;
    } while (((sta & (SDMMC_FLAG_CCRCFAIL | SDMMC_FLAG_CMDREND | SDMMC_FLAG_CTIMEOUT)) == 0U) ||
             ((sta & SDMMC_FLAG_CMDACT) != 0U));

    if ((sta & SDMMC_FLAG_CTIMEOUT) != 0U) {
        __HAL_SDIO_CLEAR_FLAG(&hsdio1, SDMMC_FLAG_CTIMEOUT);
        return SDMMC_ERROR_CMD_RSP_TIMEOUT;
    }

    if (out_resp != NULL) {
        *out_resp = SDMMC_GetResponse(hsdio1.Instance, SDMMC_RESP1);
    }

    if (SDMMC_GetCommandResponse(hsdio1.Instance) != SDMMC_CMD_SDMMC_RW_EXTENDED) {
        if ((sta & SDMMC_FLAG_CCRCFAIL) != 0U) {
            __HAL_SDIO_CLEAR_FLAG(&hsdio1, SDMMC_FLAG_CCRCFAIL);
        }
        return SDMMC_ERROR_CMD_CRC_FAIL;
    }

    if ((sta & SDMMC_FLAG_CCRCFAIL) != 0U) {
        uint32_t r5 = (out_resp != NULL) ? *out_resp : SDMMC_GetResponse(hsdio1.Instance, SDMMC_RESP1);
        uint32_t r5_err = SdioResp5Error(r5);

        __HAL_SDIO_CLEAR_FLAG(&hsdio1, SDMMC_FLAG_CCRCFAIL);
        if (r5_err != SDMMC_ERROR_NONE) {
            return r5_err;
        }
    }

    __HAL_SDIO_CLEAR_FLAG(&hsdio1, SDMMC_STATIC_CMD_FLAGS);
    return SdioResp5Error((out_resp != NULL) ? *out_resp : SDMMC_GetResponse(hsdio1.Instance, SDMMC_RESP1));
}

static HAL_StatusTypeDef SdioByteReadBlockMode(uint32_t function, uint32_t addr,
                                               uint8_t *buf, uint32_t len,
                                               uint32_t timeout_ms)
{
    SDMMC_DataInitTypeDef data = {0};
    SDMMC_CmdInitTypeDef cmd = {0};
    uint32_t err;
    uint32_t resp = 0U;
    uint32_t remain = len;
    uint32_t start = HAL_GetTick();

    hsdio1.ErrorCode = HAL_SDIO_ERROR_NONE;
    /* Full write, so FIFORST left over from an aborted transfer goes with it */
    hsdio1.Instance->DCTRL = (hsdio1.Instance->DCTRL & SDMMC_DCTRL_SDIOEN) ? SDMMC_DCTRL_SDIOEN : 0U;

    data.DataTimeOut = SDMMC_DATATIMEOUT;
    data.DataLength = len;
    data.DataBlockSize = SDMMC_DATABLOCK_SIZE_1B;
    data.TransferDir = SDMMC_TRANSFER_DIR_TO_SDMMC;
    data.TransferMode = SDMMC_TRANSFER_MODE_SDIO;
    data.DPSM = SDMMC_DPSM_DISABLE;
    (void)SDMMC_ConfigData(hsdio1.Instance, &data);
    __SDMMC_CMDTRANS_ENABLE(hsdio1.Instance);

    cmd.Argument = SdioCmd53Arg(function, addr, len, HAL_SDIO_MODE_BYTE, 0U);
    cmd.CmdIndex = SDMMC_CMD_SDMMC_RW_EXTENDED;
    cmd.Response = SDMMC_RESPONSE_SHORT;
    cmd.WaitForInterrupt = SDMMC_WAIT_NO;
    cmd.CPSM = SDMMC_CPSM_ENABLE;
    (void)SDMMC_SendCommand(hsdio1.Instance, &cmd);

    err = SdioWaitResp5(&resp);
    if (err != SDMMC_ERROR_NONE) {
        hsdio1.ErrorCode |= err;
        MODIFY_REG(hsdio1.Instance->DCTRL, SDMMC_DCTRL_FIFORST, SDMMC_DCTRL_FIFORST);
        __HAL_SDIO_CLEAR_FLAG(&hsdio1, SDMMC_STATIC_FLAGS);
        __HAL_SDIO_CLEAR_FLAG(&hsdio1, SDMMC_STATIC_DATA_FLAGS);
        __SDMMC_CMDTRANS_DISABLE(hsdio1.Instance);
        return HAL_ERROR;
    }

    while ((hsdio1.Instance->STA & (SDMMC_FLAG_RXOVERR | SDMMC_FLAG_DCRCFAIL |
                                    SDMMC_FLAG_DTIMEOUT | SDMMC_FLAG_DATAEND)) == 0U) {
        if (((hsdio1.Instance->STA & SDMMC_FLAG_RXFIFOE) == 0U) && (remain > 0U)) {
            uint32_t v = SDMMC_ReadFIFO(hsdio1.Instance);
            uint32_t i;

