khofesh/stm32-projects/nucleo-h533re/002_esp_at_sdio/Core/Src/at_sdio/platform/sdio_driver_port.c
            for (i = 0U; (i < 4U) && (remain > 0U); i++) {
                *buf++ = (uint8_t)(v >> (i * 8U));
                remain--;
            }
        }
        if ((HAL_GetTick() - start) >= timeout_ms) {
            SDIO_LOGD(TAG, "byte read timeout addr 0x%lx len %lu STA=0x%08lx DCTRL=0x%08lx DCOUNT=%lu resp=0x%08lx",
                      (unsigned long)addr, (unsigned long)len,
                      (unsigned long)hsdio1.Instance->STA,
                      (unsigned long)hsdio1.Instance->DCTRL,
                      (unsigned long)hsdio1.Instance->DCOUNT,
                      (unsigned long)resp);
            hsdio1.ErrorCode |= HAL_SDIO_ERROR_TIMEOUT;
            __HAL_SDIO_CLEAR_FLAG(&hsdio1, SDMMC_STATIC_FLAGS);
            __SDMMC_CMDTRANS_DISABLE(hsdio1.Instance);
            return HAL_TIMEOUT;
        }
    }

    __SDMMC_CMDTRANS_DISABLE(hsdio1.Instance);

    if ((hsdio1.Instance->STA & SDMMC_FLAG_DTIMEOUT) != 0U) {
        hsdio1.ErrorCode |= HAL_SDIO_ERROR_DATA_TIMEOUT;
    } else if ((hsdio1.Instance->STA & SDMMC_FLAG_DCRCFAIL) != 0U) {
        hsdio1.ErrorCode |= HAL_SDIO_ERROR_DATA_CRC_FAIL;
    } else if ((hsdio1.Instance->STA & SDMMC_FLAG_RXOVERR) != 0U) {
        hsdio1.ErrorCode |= HAL_SDIO_ERROR_RX_OVERRUN;
    }

    __HAL_SDIO_CLEAR_FLAG(&hsdio1, SDMMC_STATIC_FLAGS);
    return (hsdio1.ErrorCode == HAL_SDIO_ERROR_NONE) ? HAL_OK : HAL_ERROR;
}

sdio_err_t sdio_driver_read_bytes(uint32_t function, uint32_t addr, void *buffer, uint32_t len)
{
    return SdioTransfer(function, addr, buffer, len, HAL_SDIO_MODE_BYTE, 0U);
}

sdio_err_t sdio_driver_write_bytes(uint32_t function, uint32_t addr, void *buffer, uint32_t len)
{
    return SdioTransfer(function, addr, buffer, len, HAL_SDIO_MODE_BYTE, 1U);
}

sdio_err_t sdio_driver_read_blocks(uint32_t function, uint32_t addr, void *buffer, uint32_t len)
{
    return SdioTransfer(function, addr, buffer, len, HAL_SDIO_MODE_BLOCK, 0U);
}

sdio_err_t sdio_driver_write_blocks(uint32_t function, uint32_t addr, void *buffer, uint32_t len)
{
    return SdioTransfer(function, addr, buffer, len, HAL_SDIO_MODE_BLOCK, 1U);
}

sdio_err_t sdio_driver_wait_int(uint32_t timeout)
{
    uint32_t start = HAL_GetTick();

    esp_int_flag = 0U;
    __HAL_SDIO_CLEAR_FLAG(&hsdio1, SDMMC_FLAG_SDIOIT);
    __HAL_SDIO_ENABLE_IT(&hsdio1, SDMMC_IT_SDIOIT);
    __SDMMC_OPERATION_ENABLE(hsdio1.Instance);

    while (esp_int_flag == 0U) {
        if ((HAL_GetTick() - start) > timeout) {
            __HAL_SDIO_DISABLE_IT(&hsdio1, SDMMC_IT_SDIOIT);
            return ERR_TIMEOUT;
        }
    }
    return SDIO_SUCCESS;
}
